Revit 2024 API
Document.Title Property
 The document's title.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Title { get; }
Visual Basic
Public ReadOnly Property Title As String
	Get
Visual C++
public:
property String^ Title {
	String^ get ();
}
Remarks
 Title is derived from the document's filename, not including the filename extension. Note that returned title will be defaulted if no document saved. Note that returned string may be empty if a document is detached. See IsDetached.
See Also
Document Class
Autodesk.Revit.DB Namespace